import pytest

from src.masks import get_mask_account, get_mask_card_number


@pytest.mark.parametrize(
    "card_number, expected",
    [
        ("7000792289606361", "7000 79** **** 6361"),
        ("Maestro 1596837868705199", "1596 83** **** 5199"),
        ("Visa Platinum 8990922113665229", "8990 92** **** 5229"),
        ("£$%5 409312554362142", "Введен неверный номер карты"),
        ("70007922896063616361", "Введен неверный номер карты"),
        (" ", "Пустая строка. Введите номер карты"),
        ("Maestro ", "Введен неверный номер карты"),
        ("7002588246816355", "7002 58** **** 6355"),
        ("7OOO79228960636", "Введен неверный номер карты"),
    ],
)
def test_get_mask_card_number(card_number, expected):
    assert get_mask_card_number(card_number) == expected


@pytest.mark.parametrize(
    "card_account, expected",
    [
        ("Счет 35383033474447895560", "Счет **5560"),
        ("Счет 353830334744478997225", "Введен неверный номер счета"),
        ("£$%5 40955134482994237225", "Введен неверный номер счета"),
        (" ", "Пустая строка. Введите номер счета"),
        ("Счет ", "Введен неверный номер счета"),
        ("Cxtn 35383033474447895560", "Введен неверный номер счета"),
        ("Cxtn 40884435418", "Введен неверный номер счета"),
        ("Счет 330521648225421", "Введен неверный номер счета"),
    ],
)
def test_get_mask_account(card_account, expected):
    assert get_mask_account(card_account) == expected
